// МАСИВИ:

const chisla = [13, 14, 18, 20, 10];

console.log('first el:', chisla[0]); // -> връща първият елемент от масива
console.log(chisla.length); // -> дължината на масива
console.log('last el:', chisla[chisla.length - 1]); // -> връща последният елемент от масива
console.log('------------------------');

//-------------------------------------------------------------------------------------------------

chisla[0] = 54; // -> презаписваме стойността, която се намира на 0-ев индекс;
chisla[chisla.length - 1] = 100; // -> презаписваме стойността на последния възможен индекс със 100
chisla[10] = 1; // -> можем да записваме стойност на индекс, който не е последователен;
console.log(chisla);
console.log('------------------------');

//-------------------------------------------------------------------------------------------------

const num = []; // -> създаване на празен масив;
//МЕТОДИ
num.push(10); // добавяне на елемент в края на масива;
num.push(50); // добавяне на елемент в края на масива;
console.log(num);
console.log(num.includes(5)); // -> търси дали имаме дадения елемент в масива; връща TRUE / FLASE;
console.log(num.toString()); // -> превръща елементите в стринг
console.log(num.join('==')); // -> конкатениране на елементите на масива чрез определен символ(може и спейс) и ги връща, като стринг;
console.log(num.reverse()); // -> обръща реципрочно подредбата на масива: първият става последен, и последният става първи;
